function convert(dateStr) {
 
    var dict = {
        "0": "Ｏ",
        "1": "一",
        "2": "二",
        "3": "三",
        "4": "四",
        "5": "五",
        "6": "六",
        "7": "七",
        "8": "八",
        "9": "九",
        "01": "一",
        "02": "二",
        "03": "三",
        "04": "四",
        "05": "五",
        "06": "六",
        "07": "七",
        "08": "八",
        "09": "九",
        "10": "十",
        "11": "十一",
        "12": "十二",
        "13": "十三",
        "14": "十四",
        "15": "十五",
        "16": "十六",
        "17": "十七",
        "18": "十八",
        "19": "十九",
        "20": "二十",
        "21": "廿一",
        "22": "廿二",
        "23": "廿三",
        "24": "廿四",
        "25": "廿五",
        "26": "廿六",
        "27": "廿七",
        "28": "廿八",
        "29": "廿九",
        "30": "三十",
        "31": "卅一"

    };
    if(dateStr == ''){
        return  ;
    }
    var date = dateStr.split('-'),
        yy = date[0],
        mm = date[1],
        dd = date[2];
       var yearStr = dict[yy[0]] + dict[yy[1]] + dict[yy[2]] + dict[yy[3]] + ',',
        monthStr = dict['' + Number(mm)] + ',',
        dayStr = dict[dd];

    return yearStr + monthStr + dayStr

}